Revit 2027 API
NumberingSchemaTypes.StructuralNumberingSchemas.Rebar Property
 Built-in schema used for numbering rebar elements
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static NumberingSchemaType Rebar { get; }
Public Shared ReadOnly Property Rebar As NumberingSchemaType
	Get
public:
static property NumberingSchemaType^ Rebar {
	NumberingSchemaType^ get ();
}
static member Rebar : NumberingSchemaType with get
Property Value
NumberingSchemaType
See Also
Reference
NumberingSchemaTypes.StructuralNumberingSchemas Class
Autodesk.Revit.DB Namespace